[
   // Types used: Update, Pack announcement, Sale, New Feature
   {
      "type": "New Feature",
      "title": "The Sims is getting log-in rewards",
      "image_src": "/static/images/blog/LogInRewards.png",
      "image_alt": "An image showing content from The Sims 4, featuring various items and Sims. 1: A dartboard, a male Sim, a folded cardboard box. 2: A wooden cabinet and a female Sim. 3: Pillows and an icon with a purple face. 4: A vending machine and two Sims (an adult and a child) standing.",
      "description": "The Sims announced a new log-in rewards feature that they call \"Events\". In the first week you'll have to log in three times, twice in the second & third week and once in the fourth, final week. But don't worry, they're starting to roll out the feature today, but the weeks won't start counting until you see the pop-up in-game. <br /> <br /> Let's get to the Items: In the first week, you can get a dart board, a layered necklace and a mini fridge with a recolor of the money trash can from the base game. In the second week you can get a one tile wide bar and a cool new hairstyle. In the third week, you will be able to get new pillows and a new trait called \"Practice makes Perfect\". In the last week you can get a vending machine! You can also see the items in the picture above. You can find a detailed tutorial (video) [here] on the EA blog.",
      "link": "https://www.ea.com/games/the-sims/the-sims-4/news/the-sims-4-events",
      "published_date": "May 30, 2024",
      "author": "Jesper"
   },
   {
      "type": "Update",
      "title": "Update May 28, 2024",
      "image_src": "/static/images/blog/generalupdate.jpg",
      "image_alt": "A blue circular icon with two white curved arrows forming a circle around a plumbob in the center. The background features various shades of blue triangles and patterns.",
      "description": "The Sims Team just published a new update! These are the key fixes: <ul><li>Dishes won't hide anymore; they'll be cleaned up properly.</li><li>Gardens stay weed-free even when out of season.</li><li>Campfires won't cause chaos on your lot.</li><li>No more annoying trash can reminders.</li><li>Skills stay stable, even when you leave the lot.</li><li>Packs are listed correctly in the Build/Buy filter.</li><li>Performance improvements mean smoother gameplay and faster load times.</li><li>Plus, various pack-specific fixes!</li></ul> I can't include everything here, so [read more] on the EA blog post!",
      "link": "https://www.ea.com/games/the-sims/the-sims-4/news/update-5-28-2024",
      "published_date": "May 28, 2024",
      "author": "Jesper"
   },
   {
      "type": "Pack announcement",
      "title": "New Kits got announced!",
      "image_src": "/static/images/blog/rivieraretreatcozybistro.jpg",
      "image_alt": "Split-screen image featuring \"The Sims 4\" characters. Left: A character enjoying wine by a pool with \"Riviera Retreat Kit\" text. Right: A character sipping from a glass in a bistro with \"Cozy Bistro Kit\" text. Both settings convey a relaxed, social atmosphere.",
      "description": "The Riviera Retreat Kit & the Cozy Bistro Kit just got announced. The Riviera Retreat Kit is a pool themed Kit with new pool fountains, pool trims, stucco, archways and more! <br /> <br /> The Cozy Bistro Kit is a bistro themed Kit with new tables, chairs, awnings wallpapers and more! <br /> <br /> They will both be available May 30, 2024 on all usual platforms. You can find more about these in the EA blog post [here].",
      "link": "https://www.ea.com/games/the-sims/the-sims-4/news/cozy-bistro-and-riviera-retreat-kits",
      "published_date": "May 28, 2024",
      "author": "Jesper"
   },
   {
      "type": "Sale",
      "title": "The Blooming Rooms Kit is FREE!",
      "image_src": "/static/images/cover/The_Sims_4_Blooming_Rooms_Cover.jpg",
      "image_alt": "Illustration of a room filled with various potted plants, including large leafy greens, a small tree, and a citrus plant with oranges. A window in the background lets in light. Text reads \"Blooming Rooms Kit\" with \"The Sims 4\" logo in the bottom left corner.",
      "description": "You can get the Blooming Rooms Kit for free now and then have it forever. Click [here] to be taken to the official EA Website to redeem it for free! <br /> <br /> Disclaimer: This offer is exclusively accessible through the EA App on Mac and PC until June 17th.",
      "link": "https://www.ea.com/games/the-sims/the-sims-4/store/addons/the-sims-4-blooming-rooms-kit",
      "published_date": "May 25, 2024",
      "author": "Jesper"
   },
   {
      "type": "Pack announcement",
      "title": "New Kit: \"Party Essentials\"",
      "image_src": "/static/images/cover/The_Sims_4_Party_Essentials_Cover.jpg",
      "image_alt": "A promotional image for The Sims 4 Party Essentials Kit showing a decorated party room with balloons, a disco ball, a table with party supplies, and a large golden backdrop.",
      "description": "The Sims announced two new kits! This one - the Party Essentials Kit has party props like baloons, a fog machine, speakers, a disco ball and more! Both of the Kits are scheduled to be released April 18th, 2024 at 10AM Pacific Time. They will cost 4,99 USD / 4,99 EUR each. You can get it [here].",
      "link": "https://www.ea.com/games/the-sims/the-sims-4/store/addons/the-sims-4-party-essentials-kit",
      "published_date": "April 10, 2024",
      "author": "Jesper"
   },
   {
      "type": "Pack announcement",
      "title": "New Kit: \"Urban Homage\"",
      "image_src": "/static/images/cover/The_Sims_4_Urban_Homage_Cover.jpg",
      "image_alt": "Promotional image for \"The Sims 4 Urban Homage Kit\" showing four animated characters in trendy urban outfits against a light blue background.",
      "description": "The Sims announced two new kits! This one - the Urban Homage Kit was created in collaboration with Danielle \"Ebonix\" Udogaranya. It has London-city 90s and 2000s inspired clothing with lively patterns, vibrant graffiti motifs and eye-catching accessories. Both of the Kits are scheduled to be released April 18th, 2024 at 10AM Pacific Time. They will cost 4,99 USD / 4,99 EUR each. You can get it [here].",
      "link": "https://www.ea.com/games/the-sims/the-sims-4/store/addons/the-sims-4-urban-homage-kit",
      "published_date": "April 10, 2024",
      "author": "Jesper"
   }
]